Revit 2021.1 API
Field.CompatibleDisplayUnitType Method
 Checks if the specified type is compatible with the field description.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2012
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CompatibleUnit(ForgeTypeId)` method instead.")]
public bool CompatibleDisplayUnitType(
	DisplayUnitType type
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CompatibleUnit(ForgeTypeId)` method instead.")> _
Public Function CompatibleDisplayUnitType ( _
	type As DisplayUnitType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `CompatibleUnit(ForgeTypeId)` method instead.")]
public:
bool CompatibleDisplayUnitType(
	DisplayUnitType type
)
Parameters
type
Type: Autodesk.Revit.DB.DisplayUnitType
 The type to check.
Return Value
 True if the type is compatible, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Field Class
Autodesk.Revit.DB.ExtensibleStorage Namespace